test_config/cfe/DataProcessors/AVS_ВыгрузкаДанных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>AVS_ВыгрузкаДанных</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>РежимВыгрузки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОчиститьРегистрПослеВыгрузки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорневаяКатегория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.AVS_КатегорииНоменклатурыСайт</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВключатьПодкатегории</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

test_config/cfe/InformationRegisters/AVS_СоставКатегорийНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>AVS_СоставКатегорийНоменклатуры</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СвязкаАктивна</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Категория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.AVS_КатегорииНоменклатурыСайт</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

test_config/cfe/ChartsOfCharacteristicTypes/ДополнительныеРеквизитыИСведения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<ChartOfCharacteristicTypes>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ДополнительныеРеквизитыИСведения</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Виден</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВладелецДополнительныхЗначений</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВыводитьВВидеГиперссылки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДополнительныеЗначенияИспользуются</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДополнительныеЗначенияСВесом</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Доступен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Заголовок</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>75</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗаголовокФормыВыбораЗначения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗаголовокФормыВыбораЗначенияЯзык1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗаголовокФормыВыбораЗначенияЯзык2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗаголовокФормыЗначения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗаголовокФормыЗначенияЯзык1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗаголовокФормыЗначенияЯзык2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗаголовокЯзык1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>75</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗаголовокЯзык2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>75</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗаполнятьОбязательно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ИдентификаторДляФормул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>МногострочноеПолеВвода</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НаборСвойств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаборыДополнительныхРеквизитовИСведений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Подсказка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПодсказкаЯзык1</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПодсказкаЯзык2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ФорматСвойства</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЭтоДополнительноеСведение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВидСвойства</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСвойств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЦветСвойства</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЦветаСвойств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>AVS_ВыгружатьНаСайт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>AVS_ТипЗначенияХарактеристики</Name>
					<Type>
						<v8:Type>cfg:EnumRef.AVS_ТипЗначенияХарактеристики</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>AVS_ВариантыЗначений</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>AVS_ГруппаХарактеристик</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>AVS_ТипСвязки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.AVS_ТипСвязки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</ChartOfCharacteristicTypes>
</MetaDataObject>

test_config/cfe/DataProcessors/AVS_ВыгрузкаДанных/Ext/ObjectModule.bsl
// { AVS: Внешняя обработка выгрузки данных }

Перем Лог;
Перем СписокФайловДляСкачивания;

Процедура ВыполнитьВыгрузку(ПараметрыВыгрузки) Экспорт
	
	// В процедуру ВыполнитьВыгрузку добавлена инициализация списка
СписокФайловДляСкачивания = Новый СписокЗначений;
	
	Лог = Новый СписокЗначений;
	ДобавитьВЛог("--- Запуск выгрузки ---");
	
	Попытка
		// 1. Характеристики (features) — ТЗ 2.4 приоритет 1
		МассивКатегорий = ОпределитьСписокКатегорий(ПараметрыВыгрузки);
		JSON_Метаданные = ВыгрузитьМетаданныеХарактеристик(ПараметрыВыгрузки, МассивКатегорий);
		Если ЗначениеЗаполнено(JSON_Метаданные) Тогда
			СохранитьФайл("features.json", JSON_Метаданные);
		КонецЕсли;

		// 2. Категории (categories) — ТЗ 2.4 приоритет 2
		Если МассивКатегорий.Количество() > 0 Тогда
			JSON_Категории = AVS_ВыгрузкаНаСайт.ВыгрузитьКатегории(МассивКатегорий);
			СохранитьФайл("categories.json", JSON_Категории);
			ДобавитьВЛог("Выгружено категорий: " + МассивКатегорий.Количество());
		КонецЕсли;
		
		// 3. Товары (products) — ТЗ 2.4 приоритет 3
		МассивТоваров = ОпределитьСписокТоваров(ПараметрыВыгрузки, МассивКатегорий);
		Если МассивТоваров.Количество() > 0 Тогда
			// Вызываем новую функцию с сокращенным форматом
			JSON_Товары = AVS_ВыгрузкаНаСайт.AVS_ВыгрузитьТовары(МассивТоваров);
			СохранитьФайл("products.json", JSON_Товары);
			ДобавитьВЛог("Выгружено товаров: " + МассивТоваров.Количество());
		КонецЕсли;

		// 4. Связки (bundles) — ТЗ 2.4 приоритет 4
		МассивСвязок = ОпределитьСписокСвязок(ПараметрыВыгрузки, МассивТоваров);
		Если МассивСвязок.Количество() > 0 Тогда
			JSON_Связки = AVS_ВыгрузкаНаСайт.AVS_ВыгрузитьСвязкиПоСписку(МассивСвязок);
			Если JSON_Связки <> "[]" Тогда
				СохранитьФайл("bundles.json", JSON_Связки);
				ДобавитьВЛог("[AVS DEBUG]: Выгрузка связок (bundles) завершена.");
			КонецЕсли;
		КонецЕсли;
		
		Если ПараметрыВыгрузки.Режим = 1 Тогда // Только в режиме "По изменениям"
		ВыгрузитьУдаленныеОбъекты(ПараметрыВыгрузки);
	КонецЕсли;
		
		// Очистка регистра (ТЗ 2.3)
		Если ПараметрыВыгрузки.ОчиститьРегистр Тогда
			ОчиститьЖурналИзменений(ПараметрыВыгрузки);
		КонецЕсли;
		
		ДобавитьВЛог("--- Выгрузка завершена успешно ---");
		
	Исключение
		ТекстОшибки = "[AVS ERROR]: " + ОписаниеОшибки();
		ДобавитьВЛог(ТекстОшибки);
		Сообщить(ТекстОшибки);
	КонецПопытки;

КонецПроцедуры

#Область СлужебныйПрограммныйИнтерфейс

Функция ОпределитьСписокКатегорий(Параметры)
	
	Массив = Новый Массив;
	Если Параметры.Режим = 0 Тогда // Полная
		Запрос = Новый Запрос("ВЫБРАТЬ Ссылка ИЗ Справочник.AVS_КатегорииНоменклатурыСайт ГДЕ НЕ ПометкаУдаления");
		Массив = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	ИначеЕсли Параметры.Режим = 1 Тогда // Изменения (БЕЗ ПЕРИОДА)
		Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗЛИЧНЫЕ Рег.Объект КАК Ссылка ИЗ РегистрСведений.AVS_РегистрИзмененийКатегорийСайта КАК Рег 
		|ГДЕ Рег.Объект ССЫЛКА Справочник.AVS_КатегорииНоменклатурыСайт И Рег.ВидСобытия <> ЗНАЧЕНИЕ(Перечисление.AVS_ВидСобытия.DELETE)");
		Массив = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	Иначе // Тест
		л_ВключатьПодкатегории = Ложь; // Значение по умолчанию
		Если ТипЗнч(Параметры) = Тип("Структура") И Параметры.Свойство("ВключатьПодкатегории") Тогда
			л_ВключатьПодкатегории = Параметры.ВключатьПодкатегории;
		КонецЕсли;
		
		ТекстЗапроса = "ВЫБРАТЬ Ссылка ИЗ Справочник.AVS_КатегорииНоменклатурыСайт ГДЕ НЕ ПометкаУдаления И " + // Добавлен фильтр
			?(л_ВключатьПодкатегории, "Ссылка В ИЕРАРХИИ(&Корневая)", "Ссылка = &Корневая");
			
		Запрос = Новый Запрос(ТекстЗапроса);
		Запрос.УстановитьПараметр("Корневая", Параметры.КорневаяКатегория);
		Массив = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	КонецЕсли;
	Возврат Массив;
КонецФункции

Функция ОпределитьСписокТоваров(Параметры, МассивКатегорий)
	Массив = Новый Массив;
	Если Параметры.Режим = 0 Тогда // Полная
		Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ Номенклатура ИЗ РегистрСведений.AVS_СоставКатегорийНоменклатуры ГДЕ СвязкаАктивна = ИСТИНА");
		Массив = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Номенклатура");
	ИначеЕсли Параметры.Режим = 1 Тогда // Изменения (БЕЗ ПЕРИОДА)
		Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗЛИЧНЫЕ Рег.Объект КАК Ссылка ИЗ РегистрСведений.AVS_РегистрИзмененийКатегорийСайта КАК Рег 
		|ГДЕ Рег.Объект ССЫЛКА Справочник.Номенклатура И Рег.ВидСобытия <> ЗНАЧЕНИЕ(Перечисление.AVS_ВидСобытия.DELETE)");
		Массив = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	Иначе // Тест
		Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ Номенклатура ИЗ РегистрСведений.AVS_СоставКатегорийНоменклатуры ГДЕ Категория В (&Массив) И СвязкаАктивна = ИСТИНА");
		Запрос.УстановитьПараметр("Массив", МассивКатегорий);
		Массив = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Номенклатура");
	КонецЕсли;
	Возврат Массив;
	
КонецФункции

// Определяет список связок согласно новой логике событий (ТЗ 17.04)
Функция ОпределитьСписокСвязок(Параметры, МассивТоваров = Неопределено) 
	
	Массив = Новый Массив;
	Запрос = Новый Запрос;
	
	Если Параметры.Режим = 0 Тогда // Полная выгрузка
		// Собираем ВСЕ существующие связки напрямую из справочника
		Запрос.Текст = "ВЫБРАТЬ Ссылка ИЗ Справочник.AVS_ИдентификаторыСвязок ГДЕ НЕ ПометкаУдаления";
		Массив = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
		
	ИначеЕсли Параметры.Режим = 1 Тогда // По изменениям
		// Собираем только те связки, у которых в РИКС зарегистрировано событие UPDATE (изменение метаданных)
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗЛИЧНЫЕ Рег.Объект КАК Ссылка 
			|ИЗ РегистрСведений.AVS_РегистрИзмененийКатегорийСайта КАК Рег 
			|ГДЕ Рег.Объект ССЫЛКА Справочник.AVS_ИдентификаторыСвязок 
			|  И (Рег.ВидСобытия = ЗНАЧЕНИЕ(Перечисление.AVS_ВидСобытия.UPDATE) 
			|      ИЛИ Рег.ВидСобытия = ЗНАЧЕНИЕ(Перечисление.AVS_ВидСобытия.INSERT))";
		Массив = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
		
	ИначеЕсли Параметры.Режим = 2 Тогда // Тестовая выгрузка
		// Собирает связки, в которых участвуют товары выгружаемой категории
		Если МассивТоваров <> Неопределено И МассивТоваров.Количество() > 0 Тогда
			Запрос.Текст = 
				"ВЫБРАТЬ РАЗЛИЧНЫЕ Состав.Связка КАК Ссылка 
				|ИЗ РегистрСведений.AVS_СоставСвязокНоменклатуры КАК Состав 
				|ГДЕ Состав.Товар В (&МассивТоваров)";
			Запрос.УстановитьПараметр("МассивТоваров", МассивТоваров);
			Массив = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
		КонецЕсли;
	КонецЕсли;
	
	Возврат Массив;
	
КонецФункции

// { ПРАВКА: Исправлена ошибка запроса с полями неограниченной длины (ТЗ 2.2) }

Функция ВыгрузитьМетаданныеХарактеристик(Параметры, МассивКатегорий = Неопределено)
	
	Режим = Параметры.Режим;
	НужнаФильтрация = (Режим <> 0); // Добавлено определение переменной
	
	Попытка
		// 1. Если режим "По изменениям" и изменений ПВХ нет - файл НЕ создаем
		Если Режим = 1 Тогда
			ЗапросЧек = Новый Запрос(
			"ВЫБРАТЬ ПЕРВЫЕ 1 1 ИЗ РегистрСведений.AVS_РегистрИзмененийКатегорийСайта КАК Рег 
			|ГДЕ ТИПЗНАЧЕНИЯ(Рег.Объект) = ТИП(ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения)");
			Если ЗапросЧек.Выполнить().Пустой() Тогда Возврат ""; КонецЕсли;
		КонецЕсли;

		// 2. Подготовка фильтра категорий (только для режима Тест)
		МассивДляЗапроса = Новый Массив;
		Если Режим = 2 И МассивКатегорий <> Неопределено Тогда
			Для Каждого Кат Из МассивКатегорий Цикл
				Родители = AVS_ВыгрузкаНаСайт.AVS_ПолучитьМассивРодителей(Кат);
				Для Каждого Род Из Родители Цикл
					Если МассивДляЗапроса.Найти(Род) = Неопределено Тогда МассивДляЗапроса.Добавить(Род); КонецЕсли;
				КонецЦикла;
			КонецЦикла;
		КонецЕсли;

		// 3. Запрос метаданных
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ Рег.Объект КАК Свойство ПОМЕСТИТЬ втИзмененияПВХ
		|ИЗ РегистрСведений.AVS_РегистрИзмененийКатегорийСайта КАК Рег
		|ГДЕ ТИПЗНАЧЕНИЯ(Рег.Объект) = ТИП(ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения);
		|
		|ВЫБРАТЬ ХарКат.Свойство КАК Свойство, МИНИМУМ(ХарКат.ПорядокСортировки) КАК МинПорядок ПОМЕСТИТЬ втПорядки
		|ИЗ РегистрСведений.AVS_ХарактеристикиКатегорий КАК ХарКат
		|ГДЕ (&Режим <> 2 ИЛИ ХарКат.Категория В (&МассивКатегорий)) 
		|СГРУППИРОВАТЬ ПО ХарКат.Свойство;
		|
		|ВЫБРАТЬ Свойства.Ссылка, Свойства.Заголовок КАК name, Свойства.AVS_ГруппаХарактеристик КАК group_name,
		|Свойства.AVS_ТипЗначенияХарактеристики КАК ТипЗначения, Свойства.AVS_ВариантыЗначений КАК options_json, ЕСТЬNULL(втПорядки.МинПорядок, 0) КАК Порядок
		|ИЗ ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения КАК Свойства
		|ЛЕВОЕ СОЕДИНЕНИЕ втПорядки КАК втПорядки ПО Свойства.Ссылка = втПорядки.Свойство
		|ГДЕ Свойства.AVS_ВыгружатьНаСайт = ИСТИНА 
		|И (
		|    &Режим = 0 
		|    ИЛИ (&Режим = 1 И Свойства.Ссылка В (ВЫБРАТЬ Свойство ИЗ втИзмененияПВХ))
		|    ИЛИ (&Режим = 2 И Свойства.Ссылка В (ВЫБРАТЬ Свойство ИЗ втПорядки))
		|)";
		
		Запрос.УстановитьПараметр("Режим", Режим);
		Запрос.УстановитьПараметр("МассивКатегорий", МассивДляЗапроса);
		
		ТаблицаХарактеристик = Запрос.Выполнить().Выгрузить();
		Если НужнаФильтрация И ТаблицаХарактеристик.Количество() = 0 Тогда Возврат ""; КонецЕсли;

		// Формирование JSON
		МассивГрупп = Новый Массив; УникальныеГруппы = Новый Соответствие;
		Для Каждого Стр Из ТаблицаХарактеристик Цикл
			Если ПустаяСтрока(Стр.group_name) Или УникальныеГруппы[Стр.group_name] <> Неопределено Тогда Продолжить; КонецЕсли;
			МассивГрупп.Добавить(Новый Структура("id, name", AVS_СтрокаВGUID(Стр.group_name), Стр.group_name));
			УникальныеГруппы.Вставить(Стр.group_name, Истина);
		КонецЦикла;
		
		МассивХар = Новый Массив;
		Для Каждого Стр Из ТаблицаХарактеристик Цикл
			КодТипа = AVS_ВыгрузкаНаСайт.AVS_ПолучитьКодТипаНаСервере(Стр.ТипЗначения);
			СтруктураХар = Новый Структура("id, name, sort, group_id, value_type", 
				AVS_ВыгрузкаНаСайт.AVS_ПреобразоватьЗначениеДляJSON(Стр.Ссылка), Стр.name, Строка(Стр.Порядок), 
				AVS_СтрокаВGUID(Стр.group_name), КодТипа);
			Если (Найти(КодТипа, "option") > 0) И ЗначениеЗаполнено(Стр.options_json) Тогда
				СтруктураХар.Вставить("options", AVS_ВыгрузкаНаСайт.ПрочитатьJSONСтроку(Стр.options_json));
			КонецЕсли;
			МассивХар.Добавить(СтруктураХар);
		КонецЦикла;
		
		Возврат AVS_ВыгрузкаНаСайт.СформироватьJSONСтроку(Новый Структура("groups, features", МассивГрупп, МассивХар));
		
	Исключение
		ДобавитьВЛог("[AVS ERROR]: Ошибка выгрузки метаданных: " + ОписаниеОшибки()); Возврат "";
	КонецПопытки;
КонецФункции

Процедура ОчиститьЖурналИзменений(Параметры)
	Попытка
		НачатьТранзакцию();
		
		// 1. Очистка изменений категорий
		Запрос = Новый Запрос("ВЫБРАТЬ Период, Объект, ВидСобытия ИЗ РегистрСведений.AVS_РегистрИзмененийКатегорийСайта");
		Запрос.УстановитьПараметр("ДатаС", Параметры.ДатаНачала);
		Запрос.УстановитьПараметр("ДатаПо", Параметры.ДатаОкончания);
		Выборка = Запрос.Выполнить().Выбрать();
		Счетчик = 0;
        Пока Выборка.Следующий() Цикл
            Менеджер = РегистрыСведений.AVS_РегистрИзмененийКатегорийСайта.СоздатьМенеджерЗаписи();
            Менеджер.Объект = Выборка.Объект;
			Менеджер.Период = Выборка.Период;
            Менеджер.ВидСобытия = Выборка.ВидСобытия;
            Менеджер.Удалить();
            Счетчик = Счетчик + 1;
        КонецЦикла;
        
        ДобавитьВЛог("[AVS_DEBUG]   Удалено записей из основного регистра: " + Счетчик);
        
        // 2. Очистка изменений товаров (если регистр существует)
        Попытка
            МетаРегистрТовары = Метаданные.НайтиПоПолномуИмени("РегистрСведений.AVS_РегистрИзмененийТоваровСайта");
            Если МетаРегистрТовары <> Неопределено Тогда
                Запрос.Текст = "ВЫБРАТЬ Номенклатура, ВидСобытия, Период ИЗ РегистрСведений.AVS_РегистрИзмененийТоваровСайта";
                ВыборкаТовары = Запрос.Выполнить().Выбрать();
                
                СчетчикТовары = 0;
                Пока ВыборкаТовары.Следующий() Цикл
                    Менеджер = РегистрыСведений.AVS_РегистрИзмененийТоваровСайта.СоздатьМенеджерЗаписи();
                    ЗаполнитьЗначенияСвойств(Менеджер, ВыборкаТовары);
                    Менеджер.Удалить();
                    СчетчикТовары = СчетчикТовары + 1;
                КонецЦикла;
                
                ДобавитьВЛог("[AVS_DEBUG]   Удалено записей из регистра товаров: " + СчетчикТовары);
            КонецЕсли;
        Исключение
            ДобавитьВЛог("[AVS_WARN]   Ошибка при очистке регистра товаров (возможно, он не существует): " + ОписаниеОшибки());
        КонецПопытки;
        
        ЗафиксироватьТранзакцию();
        ДобавитьВЛог("[AVS_DEBUG] Журнал изменений за период очищен успешно");
        ДобавитьВЛог("[AVS_DEBUG] ===== КОНЕЦ ОчисткаЖурналаИзменений =====");
        
    Исключение
        Если ТранзакцияАктивна() Тогда ОтменитьТранзакцию(); КонецЕсли;
        ДобавитьВЛог("[AVS_ERROR] Ошибка очистки журнала: " + ОписаниеОшибки());
        ДобавитьВЛог("[AVS_DEBUG] ===== КОНЕЦ ОчисткаЖурналаИзменений (ОШИБКА) =====");
    КонецПопытки;
КонецПроцедуры

Процедура СохранитьФайл(ИмяФайла, Данные)
	Попытка
		// 1. Сохраняем во временный каталог сервера
		ПутьНаСервере = КаталогВременныхФайлов() + ИмяФайла;
		
		Текст = Новый ТекстовыйДокумент;
		Текст.УстановитьТекст(Данные);
		Текст.Записать(ПутьНаСервере, КодировкаТекста.UTF8);
		
		// 2. Регистрируем файл для последующей передачи на клиент
		СписокФайловДляСкачивания.Добавить(ПутьНаСервере, ИмяФайла);
		
	Исключение
		ДобавитьВЛог("Критическая ошибка записи файла " + ИмяФайла + ": " + ОписаниеОшибки());
	КонецПопытки;
КонецПроцедуры

Функция ПолучитьСписокФайловВыгрузки() Экспорт
	Возврат СписокФайловДляСкачивания;
КонецФункции

Процедура ДобавитьВЛог(Текст)
	Лог.Добавить(Строка(ТекущаяДата()) + ": " + Текст);
КонецПроцедуры

Функция ПолучитьЛог() Экспорт
	Возврат Лог;
КонецФункции

// { ПРАВКА: Исправлено имя системного перечисления на ХешФункция (стандарт платформы 8.3) }
Функция AVS_СтрокаВGUID(Знач Текст)
	
	Если ПустаяСтрока(Текст) Тогда Возврат ""; КонецЕсли;
	
	Попытка
		// Используем MD5 для получения стабильного хэша. 
		// ПРАВИЛЬНО: ХешФункция.MD5
		Хеширование = Новый ХешированиеДанных(ХешФункция.MD5);
		Хеширование.Добавить(Текст);
		
		// Получаем шестнадцатеричную строку из двоичных данных
		ХешСумма = СтрЗаменить(Строка(Хеширование.ХешСумма), " ", "");
		
		// Форматируем хэш в стандартный вид GUID: 8-4-4-4-12
		Результат = НРег(СтрШаблон("%1-%2-%3-%4-%5",
			Сред(ХешСумма, 1, 8),
			Сред(ХешСумма, 9, 4),
			Сред(ХешСумма, 13, 4),
			Сред(ХешСумма, 17, 4),
			Сред(ХешСумма, 21, 12)));
			
		Возврат Результат;
	Исключение
		// Если по какой-то причине хэширование недоступно, возвращаем пустую строку, 
		// чтобы не прерывать выгрузку, но фиксируем ошибку.
		Сообщить("[AVS ERROR]: Ошибка генерации GUID для '" + Текст + "': " + ОписаниеОшибки());
		Возврат "";
	КонецПопытки;
	
КонецФункции

// Выгружает объекты, помеченные в журнале как DELETE (ТЗ 2.1)
Процедура ВыгрузитьУдаленныеОбъекты(Параметры)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Рег.Объект КАК Объект
	|ИЗ
	|	РегистрСведений.AVS_РегистрИзмененийКатегорийСайта КАК Рег
	|ГДЕ
	|	Рег.ВидСобытия = ЗНАЧЕНИЕ(Перечисление.AVS_ВидСобытия.DELETE)";
	
	Запрос.УстановитьПараметр("ДатаС", Параметры.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаПо", Параметры.ДатаОкончания);
	
	Выборка = Запрос.Выполнить().Выбрать();
	МассивУдаленных = Новый Массив;
	
	Пока Выборка.Следующий() Цикл
		// ТЗ 2.1: Выгружается JSON с пометкой "deleted": true
		Данные = Новый Структура("id, deleted", 
			AVS_ВыгрузкаНаСайт.AVS_ПреобразоватьЗначениеДляJSON(Выборка.Объект), Истина);
		МассивУдаленных.Добавить(Данные);
	КонецЦикла;
	
	Если МассивУдаленных.Количество() > 0 Тогда
		СохранитьФайл("deleted.json", AVS_ВыгрузкаНаСайт.СформироватьJSONСтроку(МассивУдаленных));
		ДобавитьВЛог("Выгружено удалений: " + МассивУдаленных.Количество());
	КонецЕсли;
	
КонецПроцедуры

  #КонецОбласти  
  
  #Область Предпросмотр
  // Функция собирает данные для предпросмотра без формирования JSON
// Функция собирает данные для предпросмотра (только строки)
Функция ПолучитьДанныеДляПредпросмотра(Параметры) Экспорт
	
	Таблица = Новый ТаблицаЗначений;
	Таблица.Колонки.Добавить("ТипОбъекта", Новый ОписаниеТипов("Строка"));
	Таблица.Колонки.Добавить("Объект",      Новый ОписаниеТипов("Строка"));
	Таблица.Колонки.Добавить("GUID",        Новый ОписаниеТипов("Строка"));

	// 1. Категории
	МассивКат = ОпределитьСписокКатегорий(Параметры);
	Для Каждого Ссылка Из МассивКат Цикл
		НоваяСтр = Таблица.Добавить();
		НоваяСтр.ТипОбъекта = "Категория";
		НоваяСтр.Объект     = Строка(Ссылка);
		НоваяСтр.GUID       = AVS_ВыгрузкаНаСайт.AVS_ПреобразоватьЗначениеДляJSON(Ссылка);
	КонецЦикла;

	// 2. Товары
	МассивТов = ОпределитьСписокТоваров(Параметры, МассивКат);
	Для Каждого Ссылка Из МассивТов Цикл
		НоваяСтр = Таблица.Добавить();
		НоваяСтр.ТипОбъекта = "Товар";
		НоваяСтр.Объект     = Строка(Ссылка);
		НоваяСтр.GUID       = AVS_ВыгрузкаНаСайт.AVS_ПреобразоватьЗначениеДляJSON(Ссылка);
	КонецЦикла;
	
	// 3. Характеристики (ПВХ)
	ЗапросХар = Новый Запрос;
	ЗапросХар.Текст = "ВЫБРАТЬ Ссылка, Заголовок ИЗ ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения ГДЕ AVS_ВыгружатьНаСайт = ИСТИНА";
	Если Параметры.Режим = 1 Тогда // По изменениям
		ЗапросХар.Текст = ЗапросХар.Текст + " И Ссылка В (ВЫБРАТЬ Объект ИЗ РегистрСведений.AVS_РегистрИзмененийКатегорийСайта)";
	ИначеЕсли Параметры.Режим = 2 Тогда // Тест
		МассивВсехКатДляПоиска = Новый Массив;
		Для Каждого Кат Из МассивКат Цикл
			// Получаем массив родителей для каждой категории ветки
			Родители = AVS_ВыгрузкаНаСайт.AVS_ПолучитьМассивРодителей(Кат);
			Для Каждого Род Из Родители Цикл
				Если МассивВсехКатДляПоиска.Найти(Род) = Неопределено Тогда 
					МассивВсехКатДляПоиска.Добавить(Род); 
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
		
		ЗапросХар.Текст = ЗапросХар.Текст + " И Ссылка В (ВЫБРАТЬ Свойство ИЗ РегистрСведений.AVS_ХарактеристикиКатегорий ГДЕ Категория В (&МассивКат))";
		ЗапросХар.УстановитьПараметр("МассивКат", МассивВсехКатДляПоиска);
	КонецЕсли;
	
	ВыборкаХар = ЗапросХар.Выполнить().Выбрать();
	КолХар = 0;
	Пока ВыборкаХар.Следующий() Цикл
		НоваяСтр = Таблица.Добавить();
		НоваяСтр.ТипОбъекта = "Характеристика";
		НоваяСтр.Объект     = ВыборкаХар.Заголовок;
		НоваяСтр.GUID       = AVS_ВыгрузкаНаСайт.AVS_ПреобразоватьЗначениеДляJSON(ВыборкаХар.Ссылка);
		КолХар = КолХар + 1;
	КонецЦикла;
	
	// 4. Связки (Bundles) 
	ЗапросСвязки = Новый Запрос;
	Если Параметры.Режим = 0 Тогда // Полная: Все неудаленные связки
		ЗапросСвязки.Текст = "ВЫБРАТЬ Ссылка, Наименование КАК Наим ИЗ Справочник.AVS_ИдентификаторыСвязок ГДЕ НЕ ПометкаУдаления";
	ИначеЕсли Параметры.Режим = 1 Тогда // Изменения: Только метаданные связок (UPDATE в РИКС)
		ЗапросСвязки.Текст = 
			"ВЫБРАТЬ РАЗЛИЧНЫЕ Рег.Объект КАК Ссылка, Рег.Объект.Наименование КАК Наим 
			|ИЗ РегистрСведений.AVS_РегистрИзмененийКатегорийСайта КАК Рег 
			|ГДЕ Рег.Объект ССЫЛКА Справочник.AVS_ИдентификаторыСвязок 
			|  И (Рег.ВидСобытия = ЗНАЧЕНИЕ(Перечисление.AVS_ВидСобытия.UPDATE) 
			|      ИЛИ Рег.ВидСобытия = ЗНАЧЕНИЕ(Перечисление.AVS_ВидСобытия.INSERT))";
	ИначеЕсли Параметры.Режим = 2 И МассивТов.Количество() > 0 Тогда // Тест: Связки товаров категории
		ЗапросСвязки.Текст = 
			"ВЫБРАТЬ РАЗЛИЧНЫЕ Состав.Связка КАК Ссылка, Состав.Связка.Наименование КАК Наим 
			|ИЗ РегистрСведений.AVS_СоставСвязокНоменклатуры КАК Состав ГДЕ Состав.Товар В (&МассивТоваров)";
		ЗапросСвязки.УстановитьПараметр("МассивТоваров", МассивТов);
	КонецЕсли;
	
	КолСвязок = 0;
	Если ЗначениеЗаполнено(ЗапросСвязки.Текст) Тогда
		ВыборкаСвязок = ЗапросСвязки.Выполнить().Выбрать();
		Пока ВыборкаСвязок.Следующий() Цикл
			НоваяСтр = Таблица.Добавить();
			НоваяСтр.ТипОбъекта = "Связка";
			НоваяСтр.Объект     = ?(ПустаяСтрока(ВыборкаСвязок.Наим), "<Без названия>", ВыборкаСвязок.Наим);
			НоваяСтр.GUID       = AVS_ВыгрузкаНаСайт.AVS_ПреобразоватьЗначениеДляJSON(ВыборкаСвязок.Ссылка);
			КолСвязок = КолСвязок + 1;
		КонецЦикла;
	КонецЕсли;
	
	// 5. Удаленные объекты (только для режима изменений)
	КолУдаленных = 0;
	Если Параметры.Режим = 1 Тогда
		ЗапросУдл = Новый Запрос(
		"ВЫБРАТЬ Объект, ВидСобытия ИЗ РегистрСведений.AVS_РегистрИзмененийКатегорийСайта 
		|ГДЕ ВидСобытия = ЗНАЧЕНИЕ(Перечисление.AVS_ВидСобытия.DELETE)");
		ВыборкаУдл = ЗапросУдл.Выполнить().Выбрать();
		Пока ВыборкаУдл.Следующий() Цикл
			НоваяСтр = Таблица.Добавить();
			
			// { ПРАВКА: Определение реального типа объекта вместо жесткого "УДАЛЕНИЕ" }
			ТекОбъект = ВыборкаУдл.Объект;
			ТекТип = "Прочее";
			
			Если ТипЗнч(ТекОбъект) = Тип("СправочникСсылка.Номенклатура") Тогда
				ТекТип = "Товар";
			ИначеЕсли ТипЗнч(ТекОбъект) = Тип("СправочникСсылка.AVS_КатегорииНоменклатурыСайт") Тогда
				ТекТип = "Категория";
			ИначеЕсли ТипЗнч(ТекОбъект) = Тип("СправочникСсылка.AVS_ИдентификаторыСвязок") Тогда
				ТекТип = "Связка";
			ИначеЕсли ТипЗнч(ТекОбъект) = Тип("ПланВидовХарактеристикСсылка.ДополнительныеРеквизитыИСведения") Тогда
				ТекТип = "Характеристика";
			КонецЕсли;

			// Выводим тип и добавляем маркер удаления, чтобы в предпросмотре было наглядно
			НоваяСтр.ТипОбъекта = ТекТип + " (УДАЛЕНИЕ)"; 
			
			НоваяСтр.Объект     = Строка(ТекОбъект);
			НоваяСтр.GUID       = AVS_ВыгрузкаНаСайт.AVS_ПреобразоватьЗначениеДляJSON(ТекОбъект);
			КолУдаленных = КолУдаленных + 1;
		КонецЦикла;
	КонецЕсли;

	// Преобразуем ТаблицуЗначений в Массив структур (чтобы передать на клиент)
	МассивДляКлиента = Новый Массив;
	Для Каждого Стр Из Таблица Цикл
		СтруктураСтроки = Новый Структура("ТипОбъекта, Объект, GUID");
		ЗаполнитьЗначенияСвойств(СтруктураСтроки, Стр);
		МассивДляКлиента.Добавить(СтруктураСтроки);
	КонецЦикла;

	Итоги = Новый Структура;
	Итоги.Вставить("Список",            МассивДляКлиента); // Теперь это массив, он пройдет
	Итоги.Вставить("КолХарактеристик",  КолХар);
	Итоги.Вставить("КолКатегорий",      МассивКат.Количество());
	Итоги.Вставить("КолТоваров",        МассивТов.Количество());
	Итоги.Вставить("КолСвязок",         КолСвязок);
	Итоги.Вставить("КолУдаленных",      КолУдаленных);
	
	Возврат Итоги;
КонецФункции

#КонецОбласти 



Функция СведенияОВнешнейОбработке() Экспорт
	
	ПараметрыРегистрации = ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке("2.2.5.28" );
	
	ПараметрыРегистрации.БезопасныйРежим = Ложь; 
	ПараметрыРегистрации.Версия = "1.0.1";	
	ПараметрыРегистрации.ВерсияБСП = "2.2.5.28";
	ПараметрыРегистрации.Вид = ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиДополнительнаяОбработка();
	ПараметрыРегистрации.Информация = "Выгрузка JSON (AVS)";
	ПараметрыРегистрации.Назначение.Добавить("CRMИМаркетинг");
	ПараметрыРегистрации.Наименование = "Выгрузка JSON (AVS)";
 	ПараметрыРегистрации.ОпределитьНастройкиФормы = Ложь;
	
	НоваяКоманда                      = ПараметрыРегистрации.Команды.Добавить();
	НоваяКоманда.Представление        = НСтр( "ru = 'Выгрузка JSON (AVS)'" );
	НоваяКоманда.Идентификатор        = "AVS_ВыгрузкаJSON";
	НоваяКоманда.Использование        = "ОткрытиеФормы";
	НоваяКоманда.ПоказыватьОповещение = Истина;
	
	Возврат ПараметрыРегистрации;	
КонецФункции

Процедура ВыполнитьКоманду(ИндентификаторКоманды, ПараметрыКоманды) Экспорт
	
КонецПроцедуры
